# -*- mode:org; fill-column:79; -*-
#+title: CSV-SQLite3 Using Node
#+subtitle:Convert CSV files into data usable by SQLite3@@texinfo:@*@@
#+subtitle:{{{date}}} {{{version}}}
#+date:2019-07-14 17:44
#+macro: version Version 0.0.8

** Install the Dependencies
#+name:create-CSV-SQLite3-project
#+header: :exports both :results output
#+begin_src sh
yarn --yes init
yarn add command-line-args command-line-usage csv sqlite3 accounting
#+end_src

#+RESULTS: create-CSV-SQLite3-project
#+begin_example
yarn init v1.16.0
success Saved package.json
Done in 0.10s.
yarn add v1.16.0
info No lockfile found.
[1/4] Resolving packages...
[2/4] Fetching packages...
[3/4] Linking dependencies...
[4/4] Building fresh packages...
success Saved lockfile.
success Saved 124 new dependencies.
info Direct dependencies
├─ command-line-args@5.1.1
├─ command-line-usage@6.0.2
├─ csv@5.1.1
└─ sqlite3@4.0.9
info All dependencies
├─ abbrev@1.1.1
├─ ajv@6.10.1
├─ ansi-regex@2.1.1
├─ ansi-styles@3.2.1
├─ aproba@1.2.0
├─ are-we-there-yet@1.1.5
├─ asn1@0.2.4
├─ asynckit@0.4.0
├─ aws-sign2@0.7.0
├─ aws4@1.8.0
├─ balanced-match@1.0.0
├─ bcrypt-pbkdf@1.0.2
├─ brace-expansion@1.1.11
├─ caseless@0.12.0
├─ chalk@2.4.2
├─ chownr@1.1.2
├─ code-point-at@1.1.0
├─ color-convert@1.9.3
├─ color-name@1.1.3
├─ combined-stream@1.0.8
├─ command-line-args@5.1.1
├─ command-line-usage@6.0.2
├─ concat-map@0.0.1
├─ console-control-strings@1.1.0
├─ core-util-is@1.0.2
├─ csv-generate@3.2.3
├─ csv-parse@4.4.3
├─ csv-stringify@5.3.0
├─ csv@5.1.1
├─ dashdash@1.14.1
├─ debug@3.2.6
├─ deep-extend@0.6.0
├─ delayed-stream@1.0.0
├─ delegates@1.0.0
├─ detect-libc@1.0.3
├─ ecc-jsbn@0.1.2
├─ escape-string-regexp@1.0.5
├─ extend@3.0.2
├─ extsprintf@1.3.0
├─ fast-deep-equal@2.0.1
├─ fast-json-stable-stringify@2.0.0
├─ find-replace@3.0.0
├─ forever-agent@0.6.1
├─ form-data@2.3.3
├─ fs-minipass@1.2.6
├─ fs.realpath@1.0.0
├─ gauge@2.7.4
├─ getpass@0.1.7
├─ glob@7.1.4
├─ har-schema@2.0.0
├─ har-validator@5.1.3
├─ has-flag@3.0.0
├─ has-unicode@2.0.1
├─ http-signature@1.2.0
├─ iconv-lite@0.4.24
├─ ignore-walk@3.0.1
├─ inflight@1.0.6
├─ inherits@2.0.4
├─ ini@1.3.5
├─ is-fullwidth-code-point@1.0.0
├─ is-typedarray@1.0.0
├─ isarray@1.0.0
├─ isstream@0.1.2
├─ json-schema-traverse@0.4.1
├─ json-schema@0.2.3
├─ json-stringify-safe@5.0.1
├─ jsprim@1.4.1
├─ lodash.camelcase@4.3.0
├─ lodash.get@4.4.2
├─ mime-db@1.40.0
├─ mime-types@2.1.24
├─ minimist@0.0.8
├─ minizlib@1.2.1
├─ mkdirp@0.5.1
├─ ms@2.1.2
├─ nan@2.14.0
├─ needle@2.4.0
├─ node-pre-gyp@0.11.0
├─ nopt@4.0.1
├─ npm-bundled@1.0.6
├─ npm-packlist@1.4.4
├─ npmlog@4.1.2
├─ number-is-nan@1.0.1
├─ oauth-sign@0.9.0
├─ object-assign@4.1.1
├─ os-homedir@1.0.2
├─ os-tmpdir@1.0.2
├─ osenv@0.1.5
├─ path-is-absolute@1.0.1
├─ performance-now@2.1.0
├─ process-nextick-args@2.0.1
├─ psl@1.2.0
├─ punycode@1.4.1
├─ qs@6.5.2
├─ rc@1.2.8
├─ readable-stream@2.3.6
├─ reduce-flatten@2.0.0
├─ request@2.88.0
├─ rimraf@2.6.3
├─ safer-buffer@2.1.2
├─ sax@1.2.4
├─ semver@5.7.0
├─ set-blocking@2.0.0
├─ signal-exit@3.0.2
├─ sqlite3@4.0.9
├─ sshpk@1.16.1
├─ stream-transform@1.0.8
├─ string_decoder@1.1.1
├─ string-width@1.0.2
├─ strip-ansi@3.0.1
├─ strip-json-comments@2.0.1
├─ supports-color@5.5.0
├─ table-layout@1.0.0
├─ tar@4.4.10
├─ tough-cookie@2.4.3
├─ tunnel-agent@0.6.0
├─ tweetnacl@0.14.5
├─ uri-js@4.2.2
├─ util-deprecate@1.0.2
├─ uuid@3.3.2
├─ verror@1.10.0
├─ wide-align@1.1.3
├─ wordwrapjs@4.0.0
└─ yallist@3.0.3
Done in 10.75s.
#+end_example

